W4D5/music_app/app/controllers/albums_controller.rb

  def new
    @bands = Band.all
---
SELECT "bands".* FROM "bands"