W4D5/music_app/app/controllers/bands_controller.rb

  def update
    @band = Band.find(params[:id])
    @band.name = params[:band][:name]
    @band.save
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Hello World!"], ["updated_at", "2018-11-16 00:33:45.970110"], ["id", 1]]