W4D5/music_app/app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "pzm98yoToo6kgO3ZwzMNng"], ["updated_at", "2018-11-15 22:19:48.178419"], ["id", 1]]